create_clock -period 50.000 -name clk -waveform {0.000 25.000} [get_ports clk]
set_input_delay -clock [get_clocks clk] -min -add_delay 10.000 [get_ports {A[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 16.000 [get_ports {A[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 10.000 [get_ports {WriteData[*]}]
set_input_delay -clock [get_clocks clk] -max -add_delay 16.000 [get_ports {WriteData[*]}]
set_input_delay -clock [get_clocks clk] -min -add_delay 10.000 [get_ports WE]
set_input_delay -clock [get_clocks clk] -max -add_delay 16.000 [get_ports WE]
set_output_delay -clock [get_clocks clk] -min -add_delay 2.000 [get_ports {ReadData[*]}]
set_output_delay -clock [get_clocks clk] -max -add_delay 16.000 [get_ports {ReadData[*]}]
